[ORG 0x00]          ; 코드의 시작 어드레스를 0x00으로 설정
[BITS 16]           ; 이하의 코드는 16비트 코드로 설정

SECTION     .txt        ; text 섹션(세그먼트)을 정의

jmp 0x07C0:START        ; CS 세그먼트 레지스터에 0x07C0을 복사하면서 START 레이블로 이동


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;   MINT64 OS에 관련된 환경 설정 값
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
TOTALSECTORCOUNT:       dw 0x02         ; 부트로더를 제외한 MINT64 OS 이미지의 크기
                                        ; 최대 1152 섹터(0x90000byte)까지 가능
                                        
KERNEL32SECTORCOUNT:    dw 0x02         ; 보호 모드 커널의 총 섹터수
BOOTSTRAPPROCESSOR:     db 0x01         ; Bootstrap Processor인지 여부


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;   코드 영역
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
START:
    mov ax, 0x07C0          ; 부트 로더의 시작 어드레스(0x07C0)를 세그먼트 레지스터 값으로 변환
    mov ds, ax              ; DS 세그먼트 레지스터에 설정
    mov ax, 0xB800          ; 비디오 메모리의 시작 어드레스(0x07C0)를 세그먼트 레지스터 값으로 변환
    mov es, ax              ; ES 세그먼트 레지스터에 설정

    ; 스택을 0x0000:0000~0x0000:FFFF 영역에 64KB 크기로 생성
    mov ax, 0x0000          ; 스택 세그먼트의 시작 어드레스(0x0000)를 세그먼트 레지스터 값으로 변환
    mov ss, ax              ; SS 세그먼트 레지스터에 설정
    mov sp, 0xFFFE          ; SP 레지스터의 어드레스를 0xFFFE로 설정
    mov bp, 0xFFFE          ; BP 레지스터의 어드레스를 0xFFFE로 설정
